<?xml version="1.0" ?>
<net batch="1" name="FaceBoxes" version="4">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Add_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12" size="12"/>
				<biases offset="0" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="24" pads_begin="0,0" pads_end="0,0" strides="4,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="14112"/>
				<biases offset="14136" size="96"/>
			</blobs>
		</layer>
		<layer id="3" name="conv1/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1/scale/Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14232" size="192"/>
				<biases offset="14424" size="192"/>
			</blobs>
		</layer>
		<layer id="6" name="conv1/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="pool1" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>119</dim>
					<dim>179</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>59</dim>
					<dim>89</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>59</dim>
					<dim>89</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14616" size="307200"/>
				<biases offset="321816" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="conv2/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2/scale/Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</output>
			<blobs>
				<weights offset="322072" size="512"/>
				<biases offset="322584" size="512"/>
			</blobs>
		</layer>
		<layer id="12" name="conv2/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="pool2" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv3/incep0/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="323096" size="16384"/>
				<biases offset="339480" size="128"/>
			</blobs>
		</layer>
		<layer id="15" name="conv3/incep0/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv3/incep1/conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="339608" size="12288"/>
				<biases offset="351896" size="96"/>
			</blobs>
		</layer>
		<layer id="17" name="conv3/incep1/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv3/incep1/conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="351992" size="27648"/>
				<biases offset="379640" size="128"/>
			</blobs>
		</layer>
		<layer id="19" name="conv3/incep1/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv3/incep2/conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="379768" size="12288"/>
				<biases offset="392056" size="96"/>
			</blobs>
		</layer>
		<layer id="21" name="conv3/incep2/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv3/incep2/conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="392152" size="27648"/>
				<biases offset="419800" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="conv3/incep2/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv3/incep2/conv3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="419928" size="36864"/>
				<biases offset="456792" size="128"/>
			</blobs>
		</layer>
		<layer id="25" name="conv3/incep2/relu3" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv3/incep3/pool" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv3/incep3/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="456920" size="16384"/>
				<biases offset="473304" size="128"/>
			</blobs>
		</layer>
		<layer id="28" name="conv3/incep3/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv3/incep" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv4/incep0/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="473432" size="16384"/>
				<biases offset="489816" size="128"/>
			</blobs>
		</layer>
		<layer id="31" name="conv4/incep0/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv4/incep1/conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="489944" size="12288"/>
				<biases offset="502232" size="96"/>
			</blobs>
		</layer>
		<layer id="33" name="conv4/incep1/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv4/incep1/conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="502328" size="27648"/>
				<biases offset="529976" size="128"/>
			</blobs>
		</layer>
		<layer id="35" name="conv4/incep1/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv4/incep2/conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="530104" size="12288"/>
				<biases offset="542392" size="96"/>
			</blobs>
		</layer>
		<layer id="37" name="conv4/incep2/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv4/incep2/conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="542488" size="27648"/>
				<biases offset="570136" size="128"/>
			</blobs>
		</layer>
		<layer id="39" name="conv4/incep2/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv4/incep2/conv3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="570264" size="36864"/>
				<biases offset="607128" size="128"/>
			</blobs>
		</layer>
		<layer id="41" name="conv4/incep2/relu3" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv4/incep3/pool" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv4/incep3/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="607256" size="16384"/>
				<biases offset="623640" size="128"/>
			</blobs>
		</layer>
		<layer id="44" name="conv4/incep3/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv4/incep" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv5/incep0/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="623768" size="16384"/>
				<biases offset="640152" size="128"/>
			</blobs>
		</layer>
		<layer id="47" name="conv5/incep0/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv5/incep1/conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="640280" size="12288"/>
				<biases offset="652568" size="96"/>
			</blobs>
		</layer>
		<layer id="49" name="conv5/incep1/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv5/incep1/conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="652664" size="27648"/>
				<biases offset="680312" size="128"/>
			</blobs>
		</layer>
		<layer id="51" name="conv5/incep1/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv5/incep2/conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="680440" size="12288"/>
				<biases offset="692728" size="96"/>
			</blobs>
		</layer>
		<layer id="53" name="conv5/incep2/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv5/incep2/conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="692824" size="27648"/>
				<biases offset="720472" size="128"/>
			</blobs>
		</layer>
		<layer id="55" name="conv5/incep2/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv5/incep2/conv3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="720600" size="36864"/>
				<biases offset="757464" size="128"/>
			</blobs>
		</layer>
		<layer id="57" name="conv5/incep2/relu3" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv5/incep3/pool" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv5/incep3/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="757592" size="16384"/>
				<biases offset="773976" size="128"/>
			</blobs>
		</layer>
		<layer id="60" name="conv5/incep3/relu" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv5/incep" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Inception3/conv/loc1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="774104" size="18432"/>
				<biases offset="792536" size="16"/>
			</blobs>
		</layer>
		<layer id="63" name="Inception3/conv/loc1/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Inception3/conv/loc1/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1176</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Inception3/conv/loc2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="792552" size="18432"/>
				<biases offset="810984" size="16"/>
			</blobs>
		</layer>
		<layer id="66" name="Inception3/conv/loc2/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Inception3/conv/loc2/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1176</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Inception3/conv/loc3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="811000" size="18432"/>
				<biases offset="829432" size="16"/>
			</blobs>
		</layer>
		<layer id="69" name="Inception3/conv/loc3/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Inception3/conv/loc3/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1176</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv6_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="829448" size="65536"/>
				<biases offset="894984" size="512"/>
			</blobs>
		</layer>
		<layer id="72" name="conv6/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv6_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="895496" size="1179648"/>
				<biases offset="2075144" size="1024"/>
			</blobs>
		</layer>
		<layer id="74" name="conv6/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv6/loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2076168" size="36864"/>
				<biases offset="2113032" size="16"/>
			</blobs>
		</layer>
		<layer id="76" name="conv6/loc/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>11</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv6/loc/perm/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>11</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>308</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv7_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2113048" size="131072"/>
				<biases offset="2244120" size="512"/>
			</blobs>
		</layer>
		<layer id="79" name="conv7/relu1" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv7_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2244632" size="1179648"/>
				<biases offset="3424280" size="1024"/>
			</blobs>
		</layer>
		<layer id="81" name="conv7/relu2" precision="FP32" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv7/loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3425304" size="36864"/>
				<biases offset="3462168" size="16"/>
			</blobs>
		</layer>
		<layer id="83" name="conv7/loc/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>6</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv7/loc/perm/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>6</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="mbox_loc" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1176</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1176</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1176</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>308</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>3932</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Inception3/conv/conf1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3462184" size="9216"/>
				<biases offset="3471400" size="8"/>
			</blobs>
		</layer>
		<layer id="87" name="Inception3/conv/conf1/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Inception3/conv/conf1/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>588</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Inception3/conv/conf2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3471408" size="9216"/>
				<biases offset="3480624" size="8"/>
			</blobs>
		</layer>
		<layer id="90" name="Inception3/conv/conf2/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Inception3/conv/conf2/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>588</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Inception3/conv/conf3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3480632" size="9216"/>
				<biases offset="3489848" size="8"/>
			</blobs>
		</layer>
		<layer id="93" name="Inception3/conv/conf3/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Inception3/conv/conf3/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>14</dim>
					<dim>21</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>588</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv6/conf" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3489856" size="18432"/>
				<biases offset="3508288" size="8"/>
			</blobs>
		</layer>
		<layer id="96" name="conv6/conf/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>11</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="conv6/conf/perm/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>11</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>154</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv7/conf" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3508296" size="18432"/>
				<biases offset="3526728" size="8"/>
			</blobs>
		</layer>
		<layer id="99" name="conv7/conf/perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv7/conf/perm/flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="mbox_conf" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>588</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>588</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>588</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>154</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>1966</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Inception3/conv/priorbox1" precision="FP32" type="PriorBox">
			<data aspect_ratio="1.0" clip="1" flip="1" max_size="" min_size="32.0" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1176</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Inception3/conv/priorbox2" precision="FP32" type="PriorBox">
			<data aspect_ratio="1.0" clip="1" flip="1" max_size="" min_size="64.0" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1176</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Inception3/conv/priorbox3" precision="FP32" type="PriorBox">
			<data aspect_ratio="1.0" clip="1" flip="1" max_size="" min_size="128.0" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1176</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv6/priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="1.0" clip="1" flip="1" max_size="" min_size="256.0" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>7</dim>
					<dim>11</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>308</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv7/priorbox" precision="FP32" type="PriorBox">
			<data aspect_ratio="1.0" clip="1" flip="1" max_size="" min_size="512.0" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>720</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
